"Amharic config with language-specific information."

from pynini import *
from pynini.lib import byte
from config import utils

GRAPHEMES = union("'", "-",
                  "ሀ", "ሁ", "ሂ", "ሃ", "ሄ", "ህ", "ሆ",
                  "ለ", "ሉ", "ሊ", "ላ", "ሌ", "ል", "ሎ", "ሏ",
                  "ሐ", "ሑ", "ሒ", "ሓ", "ሔ", "ሕ", "ሖ", "ሗ",
                  "መ", "ሙ", "ሚ", "ማ", "ሜ", "ም", "ሞ", "ሟ",
                  "ሠ", "ሡ", "ሢ", "ሣ", "ሤ", "ሥ", "ሦ", "ሧ",
                  "ረ", "ሩ", "ሪ", "ራ", "ሬ", "ር", "ሮ", "ሯ",
                  "ሰ", "ሱ", "ሲ", "ሳ", "ሴ", "ስ", "ሶ", "ሷ",
                  "ሸ", "ሹ", "ሺ", "ሻ", "ሼ", "ሽ", "ሾ", "ሿ",
                  "ቀ", "ቁ", "ቂ", "ቃ", "ቄ", "ቅ",
                  "ቆ", "ቈ", "ቊ", "ቋ", "ቌ", "ቍ",
                  "በ", "ቡ", "ቢ", "ባ", "ቤ", "ብ", "ቦ", "ቧ",
                  "ቨ", "ቩ", "ቪ", "ቫ", "ቬ", "ቭ", "ቮ", "ቯ",
                  "ተ", "ቱ", "ቲ", "ታ", "ቴ", "ት", "ቶ", "ቷ",
                  "ቸ", "ቹ", "ቺ", "ቻ", "ቼ", "ች", "ቾ", "ቿ",
                  "ኀ", "ኁ", "ኂ", "ኃ", "ኄ", "ኅ",
                  "ኆ", "ኈ", "ኊ", "ኋ", "ኌ", "ኍ",
                  "ነ", "ኑ", "ኒ", "ና", "ኔ", "ን", "ኖ", "ኗ",
                  "ኘ", "ኙ", "ኚ", "ኛ", "ኜ", "ኝ", "ኞ", "ኟ",
                  "አ", "ኡ", "ኢ", "ኣ", "ኤ", "እ", "ኦ", "ኧ",
                  "ከ", "ኩ", "ኪ", "ካ", "ኬ", "ክ",
                  "ኮ", "ኰ", "ኲ", "ኳ", "ኴ", "ኵ",
                  "ኸ", "ኹ", "ኺ", "ኻ", "ኼ", "ኽ",
                  "ኾ", "ዀ", "ዂ", "ዃ", "ዄ", "ዅ",
                  "ወ", "ዉ", "ዊ", "ዋ", "ዌ", "ው", "ዎ",
                  "ዐ", "ዑ", "ዒ", "ዓ", "ዔ", "ዕ", "ዖ",
                  "ዘ", "ዙ", "ዚ", "ዛ", "ዜ", "ዝ", "ዞ", "ዟ",
                  "ዠ", "ዡ", "ዢ", "ዣ", "ዤ", "ዥ", "ዦ", "ዧ",
                  "የ", "ዩ", "ዪ", "ያ", "ዬ", "ይ", "ዮ",
                  "ደ", "ዱ", "ዲ", "ዳ", "ዴ", "ድ", "ዶ", "ዷ",
                  "ጀ", "ጁ", "ጂ", "ጃ", "ጄ", "ጅ", "ጆ", "ጇ",
                  "ገ", "ጉ", "ጊ", "ጋ", "ጌ", "ግ",
                  "ጎ", "ጐ", "ጒ", "ጓ", "ጔ", "ጕ",
                  "ጠ", "ጡ", "ጢ", "ጣ", "ጤ", "ጥ", "ጦ", "ጧ",
                  "ጨ", "ጩ", "ጪ", "ጫ", "ጬ", "ጭ", "ጮ", "ጯ",
                  "ጰ", "ጱ", "ጲ", "ጳ", "ጴ", "ጵ", "ጶ", "ጷ",
                  "ጸ", "ጹ", "ጺ", "ጻ", "ጼ", "ጽ", "ጾ", "ጿ",
                  "ፀ", "ፁ", "ፂ", "ፃ", "ፄ", "ፅ", "ፆ",
                  "ፈ", "ፉ", "ፊ", "ፋ", "ፌ", "ፍ", "ፎ", "ፏ",
                  "ፐ", "ፑ", "ፒ", "ፓ", "ፔ", "ፕ", "ፖ", "ፗ")

INITIAL_PUNCTUATION = utils.DEFAULT_INITIAL_PUNCTUATION

FINAL_PUNCTUATION = union(utils.DEFAULT_FINAL_PUNCTUATION,
                          utils.GEEZ_FINAL_PUNCTUATION)

NUMERALS = union(byte.DIGIT,
                 utils.GEEZ_NUMERALS)

REDUCE_H = union(cross("ሐ", "ሀ"),
                 cross("ሑ", "ሁ"),
                 cross("ሒ", "ሂ"),
                 cross("ሓ", "ሂ"),
                 cross("ሔ", "ሄ"),
                 cross("ሕ", "ህ"),
                 cross("ሖ", "ሆ"),
                 #cross("ሗ", "")

                 cross("ኀ", "ሀ"),
                 cross("ኁ", "ሁ"),
                 cross("ኂ", "ሂ"),
                 cross("ኃ", "ሂ"),
                 cross("ኄ", "ሄ"),
                 cross("ኅ", "ህ"),
                 cross("ኆ", "ሆ"),
                 #cross("ኈ", ""),
                 #cross("ኊ", ""),
                 #cross("ኋ", ""),
                 #cross("ኌ", ""),
                 #cross("ኍ", ""),

                 cross("ኸ", "ሀ"),
                 cross("ኹ", "ሁ"),
                 cross("ኺ", "ሂ"),
                 cross("ኻ", "ሂ"),
                 cross("ኼ", "ሄ"),
                 cross("ኽ", "ህ"),
                 cross("ኾ", "ሆ")
                 #cross("ዀ", ""),
                 #cross("ዂ", ""),
                 #cross("ዃ", ""),
                 #cross("ዄ", ""),
                 #cross("ዅ", "")
                 )


REDUCE_S = union(cross("ጸ", "ፀ"),
                 cross("ጹ", "ፁ"),
                 cross("ጺ", "ፂ"),
                 cross("ጻ", "ፃ"),
                 cross("ጼ", "ፄ"),
                 cross("ጽ", "ፅ"),
                 cross("ጾ", "ፆ"))
                 #cross("ጿ", "")

REDUCE_A = union(cross("ዐ", "አ"),
                 cross("ዑ", "አ"),
                 cross("ዒ", "ኢ"),
                 cross("ዓ", "ኣ"),
                 cross("ዔ", "ኤ"),
                 cross("ዕ", "እ"),
                 cross("ዖ", "ኦ"))

REDUCE_OVERDIFFERENTIATION = cdrewrite(
    union(REDUCE_H, REDUCE_S, REDUCE_A),
    "",
    "",
    byte.BYTES.closure())

LANGUAGE_SPECIFIC_PREPROCESSING = REDUCE_OVERDIFFERENTIATION

UD = ""
UM = ""
AC = ""
OSCAR = ""
LCC = ""
